Revit 2027 API
StairsLanding.Thickness Property
 The thickness of the landing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Thickness { get; }
Public ReadOnly Property Thickness As Double
	Get
public:
property double Thickness {
	double get ();
}
member Thickness : float with get
Property Value
Double
See Also
Reference
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace